In [1]:
import pandas as pd

In [12]:
# creating a simple dataframe

df = pd.DataFrame({'name': ['Jon','Tom','Jane','Kate'],
           'age': [35,20,28,55],
           'sex':['male','male','female','female']})

In [13]:
df

   name  age     sex
0   Jon   35    male
1   Tom   20    male
2  Jane   28  female
3  Kate   55  female

In [14]:
data = []

# always inserting new rows at the first position - last row will be always on top    
data.insert(0, {'name': 'Alex', 'age': 45, 'sex': 'male'})

# Concatanating original dataframe with additional row of data from list

pd.concat([pd.DataFrame(data), df], ignore_index=True) # does not save changes to the original dataframe

df2 = pd.concat([pd.DataFrame(data), df], ignore_index=True)

df2

   name  age     sex
0  Alex   45    male
1   Jon   35    male
2   Tom   20    male
3  Jane   28  female
4  Kate   55  female

In [16]:
# remember that df was not modified by code above. Record for Alex was added to df2

# another way of adding a row to the top of Pandas dataframe
df2.loc[-1] = ['Dean', '25', 'male']  # adding a row
df2.index = df2.index + 1  # shifting index
df2.sort_index(inplace=True)

In [17]:
df2

   name age     sex
0  Dean  25    male
1  Alex  45    male
2   Jon  35    male
3   Tom  20    male
4  Jane  28  female
5  Kate  55  female